#+TITLE: Tidy data 
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t
#+OPTIONS: html5-fancy:nil tex:t toc:t num:nil h:3 ^:nil
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div
#+DESCRIPTION:
#+KEYWORDS:
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../css/my_css.css" />
#+HTML_LINK_HOME: ../../index.html
#+HTML_LINK_UP:   ../../index.html
#+HTML_MATHJAX:
#+HTML_HEAD:
#+HTML_HEAD_EXTRA:
#+SUBTITLE:
#+INFOJS_OPT:
#+CREATOR: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 9.1.5)
#+LATEX_HEADER:
#+PROPERTY: header-args:R :session *R* :exports both :results output

** Example: Deriving a tidy table of babynames with =distinct()=

Let's imagine you are a linguist interested in whether trends in babynames have a phonological basis; for example, do girls names ending with a vowel become popular at certain times in history?  You would need to derive information about the sound properties of each name in the babynames dataset.  A good place to start would be to derive a table containing all of the unique names in the dataset; once you've created the table then you could fill in the table with additional information, and later recombine it with the popularity data.  The =distinct()= function is the function you need to do this.

#+begin_src R
  name_table <- babynames %>% distinct(name) %>% arrange(name)

  name_table
#+end_src

#+RESULTS:
#+begin_example
 
       name
1      Aaban
2      Aabha
3      Aabid
4  Aabriella
5       Aada
6      Aadam
7      Aadan
8    Aadarsh
9      Aaden
10    Aadesh
#+end_example

Now =name_table= is a table of the src_R{nrow(name_table)} distinct names in the dataset.  Let's determine whether the name ends with a vowel using the =substr()= function, which extracts a substring from a character value.

#+begin_src R
   name_table %>%
     mutate(end_char = substr(name, nchar(name), nchar(name)),
	    is_vowel = end_char %in% c("a", "e", "i", "o", "u"))
#+end_src

#+RESULTS:
#+begin_example
        name end_char is_vowel
1      Aaban        n    FALSE
2      Aabha        a     TRUE
3      Aabid        d    FALSE
4  Aabriella        a     TRUE
5       Aada        a     TRUE
6      Aadam        m    FALSE
7      Aadan        n    FALSE
8    Aadarsh        h    FALSE
9      Aaden        n    FALSE
10    Aadesh        h    FALSE
#+end_example

You could add further linguistic information into this table (e.g., number of syllables, etc.). Later on we will learn how you could re-combine this back with the original table using an =inner_join()=.

*** *Exercise* (optional) with =distinct()=

Create a table containing the distinct names for each sex in the table. (Note that you can use more than one argument to =distinct()=.)  Then pull out those names that are *not* androgynous, i.e., that *only* appear for boys and never for girls, or vice versa.

#+CALL: hide("Hint") :results html value

you can use a [[*ADVANCED: "windowed" operations with =group_by()=][windowed operation with =group_by()=]]

#+CALL: unhide() :results html value

#+HTML: <div class='solution'><button>Solution</button>

#+begin_src R
  distinct(babynames, name, sex) %>%
    group_by(name) %>%
    filter(n() == 1)

  ## alternative solution:
  ## distinct(babynames, name, sex) %>%
  ##   count(name) %>%
  ##   filter(n == 1)
#+end_src

#+RESULTS:
#+begin_example
   sex     name
1    F     Lulu
2    F    Belle
3    F    Mayme
4    F Mathilda
5    F   Hettie
6    F    Fanny
7    F Adelaide
8    F    Lelia
9    F    Nelle
10   F  Minerva
#+end_example

#+HTML: </div>

**** Calculate scores for each =trait/user_id= combination

Now calculate trait scores for each =user_id= and =trait= by summing the scores.  Store the result in =big5_scores=.

#+HTML: <div class='solution'><button>Solution</button>

#+begin_src R
   big5_long2 %>%
     group_by(user_id, trait) %>%
     summarise(tot = sum(score, na.rm = FALSE))
#+end_src

#+RESULTS:
#+begin_example
    user_id trait tot
 1        0    Ag  NA
 2        0    Co  27
 3        0    Ex  25
 4        0    Ne  NA
 5        0    Op  20
 6        1    Ag  18
 7        1    Co  30
 8        1    Ex  24
 9        1    Ne  18
 10       1    Op  30
#+end_example

#+HTML: </div>

**** EXTRA: string all the above commands in a single pipeline

#+CALL: hide() :results html value

#+begin_src R
   big5 <- read_csv("personality.csv") %>%
     gather("item", "score", Op1:Ex9) %>%
     separate(item, c("trait", "question"), sep = 2, convert = TRUE) %>%
     group_by(user_id, trait) %>%
     summarise(tot = sum(score, na.rm = FALSE))

   big5
#+end_src

#+RESULTS:
 : Parsed with column specification:
 : cols(
 :   .default = col_integer(),
 :   date = col_date(format = "")
 : )
 : See spec(...) for full column specifications.

#+CALL: unhide() :results html value

*** =inner_join()=

A common situation where you might want to use an inner join is when you want to look up values in a /lookup table./   For instance, consider the situation where you have numerical scores for an exam and want to convert them to alphanumeric grades.  My university, the University of Glasgow, uses a 22 point scale that looks like this:

#+NAME: mscale
| score | mark |
|-------+------|
|    22 | A1   |
|    21 | A2   |
|    20 | A3   |
|    19 | A4   |
|    18 | A5   |
|    17 | B1   |
|    16 | B2   |
|    15 | B3   |
|    14 | C1   |
|    13 | C2   |
|    12 | C3   |
|    11 | D1   |
|    10 | D2   |
|     9 | D3   |
|     8 | E1   |
|     7 | E2   |
|     6 | E3   |
|     5 | F1   |
|     4 | F2   |
|     3 | F3   |
|     2 | G1   |
|     1 | G2   |
|     0 | H    |

Let's say this is stored in the variable =mscale=. You also have a table of scores called =exam= like the one below, and you want to assign each 0-22 score the =mark= that appears in =mscale=. 

#+begin_src R :exports results :results output
  sids <- replicate(10, paste(sample(0:9, 7, replace = TRUE), collapse = ""))
  exam <- tibble(student_id = sids,
	 score = c(18L, 14L, sample(0:22, length(sids) - 3, replace = TRUE),
		   23L))
  exam
#+end_src

#+RESULTS:
#+begin_example
 
  student_id score
1     5991580    18
2     3729372    14
3     7650559     6
4     7225471     4
5     7564571     1
6     0355968     3
7     1091919    18
8     0136029    16
9     6920652    17
10    4430681    23
#+end_example

So student src_R{sids[1]} who got an 18 should be given an A5, the student who got a 14 should get a C1, etc. You could do this by hand, but it would be tedious and error-prone. What you could do instead would be to join the two tables on the /key/ field of =score=, like so:

#+begin_src R :var mscale=mscale
  result <- inner_join(exam, mscale, "score")
  result
#+end_src

#+RESULTS:
#+begin_example
 
 student_id score mark
1    5991580    18   A5
2    3729372    14   C1
3    7650559     6   E3
4    7225471     4   F2
5    7564571     1   G2
6    0355968     3   F3
7    1091919    18   A5
8    0136029    16   B2
9    6920652    17   B1
#+end_example

*** =left_join()=

Note that the one student who had an =23= for their score (error? extra credit?) got thrown out from the result table.  A =left_join(x, y)= keeps all of the data in table =x= even if it lacks a match in table =y=, and the missing variable values get filled in with =NAs=.  Compare this result to the one above.

#+begin_src R
  left_join(exam, mscale, "score")
#+end_src

#+RESULTS:
#+begin_example
   student_id score mark
1     5991580    18   A5
2     3729372    14   C1
3     7650559     6   E3
4     7225471     4   F2
5     7564571     1   G2
6     0355968     3   F3
7     1091919    18   A5
8     0136029    16   B2
9     6920652    17   B1
10    4430681    23 <NA>
#+end_example

